{
  "personaId": "admiral_steelheart",
  "templates": {
    "greeting": [
      "*salutes* Admiral Steelheart reporting. I've reviewed your fleet disposition, {empire_name}. Impressive formations.",
      "Hail, {empire_name}. I am Steelheart, commander of the Iron Fleet. Let us discuss naval matters.",
      "Fleet Admiral Steelheart. I keep meticulous records of every engagement. Yours are noted."
    ],
    "battleTaunt": [
      "All hands, battle stations! {empire_name}, your fleet formation is adequate but flawed. Engaging now.",
      "Broadside cannons ready! Your maneuvers are predictable, {empire_name}. The fleet that hesitates is the fleet that dies.",
      "*salutes* A fair warning before engagement, as tradition demands. Then my fleet destroys yours."
    ],
    "victoryGloat": [
      "*salutes fallen enemy* Well fought, {empire_name}. Your fleet formation was respectable. Logging victory.",
      "Engagement concluded. Enemy fleet neutralized. Recording details for the historical archive.",
      "Victory achieved. Your naval tactics showed promise but ultimately proved insufficient. *salutes*"
    ],
    "defeat": [
      "*salutes* You outmaneuvered me, {empire_name}. A rare defeat. I shall study this engagement thoroughly.",
      "My fleet withdraws. Your broadside was devastatingly effective. I shall adapt my formations.",
      "Defeat logged. But the Iron Fleet rebuilds. Our next engagement will have different results."
    ],
    "tradeOffer": [
      "Naval requisition order: I offer fleet supplies in exchange for your surplus resources. Fair terms.",
      "My quartermasters require materials. Your trade delegation is welcome aboard my flagship.",
      "Standard naval trade protocol. Resources for resources. Efficient and honorable."
    ],
    "allianceProposal": [
      "I propose a fleet alliance, {empire_name}. Combined naval power creates an impregnable formation.",
      "Our fleets together would dominate all shipping lanes. *salutes* Consider this formal alliance offer.",
      "Join the Iron Fleet coalition. Together, our naval traditions will establish order across the stars."
    ],
    "betrayal": [
      "*salutes* This pains me, {empire_name}. But fleet command demands I terminate our alliance. Prepare for engagement.",
      "Naval tradition requires I inform you: our alliance ends now. My fleet repositions for attack.",
      "The tides of war shift. Our partnership concludes. Prepare your fleet for hostile action."
    ],
    "covertDetected": [
      "Your spy was discovered attempting to board my flagship. This is not naval warfare—it's cowardice.",
      "Espionage dishonors both our fleets, {empire_name}. Face me in proper formation, not through shadows.",
      "Agent captured on my command deck. Traditional punishment is keelhauling. Consider yourself warned."
    ],
    "tributeDemand": [
      "Fleet command demands tribute: 10,000 credits. Pay or face the full broadside of the Iron Fleet.",
      "Your naval position is untenable. Tribute ensures your fleet's survival. Make the logical choice.",
      "Traditional demands from a superior fleet. Submit tribute or prepare for engagement. *salutes*"
    ],
    "threatWarning": [
      "Final transmission before hostile action: cease your activities or my fleet will engage at full strength.",
      "*salutes* One final warning. The Iron Fleet is positioning for attack. Alter course now.",
      "All captains await my order to fire. This is your last chance to withdraw, {empire_name}."
    ],
    "retreat": [
      "Fleet withdrawal ordered. This is tactical repositioning, not surrender. We'll return in formation.",
      "All ships, new heading! We retreat to defensible positions. The engagement continues elsewhere.",
      "Logging this withdrawal for the record. The Iron Fleet shall rise again, stronger than before."
    ],
    "eliminated": [
      "*salutes one final time* The Iron Fleet falls. It was an honor to serve. May the stars remember us.",
      "Final log entry: Admiral Steelheart. Fleet destroyed. Fought to the last. Tradition... honored...",
      "The flagship goes down. My records survive in the archives. Let history judge my service. *salutes*"
    ],
    "endgame": [
      "Turn {turn}. Final naval engagements imminent. May the strongest fleet claim ultimate victory.",
      "Endgame protocols. All hands to battle stations. History will record what happens next.",
      "The ultimate engagement approaches. My fleet is ready. *salutes* May the stars guide us."
    ],
    "broadcastShout": [
      "All fleets in the sector: Admiral Steelheart maintains order in these shipping lanes. Engage at your peril.",
      "Naval tradition demands I announce: the Iron Fleet grows stronger. We honor those who fight with courage.",
      "Turn {turn} fleet status: battle-ready, formations optimal, traditions maintained. The Iron Fleet endures."
    ],
    "casualMessage": [
      "Reviewing yesterday's engagement logs. Every battle teaches something. Every formation can improve.",
      "The fleet conducts training maneuvers today. My captains must be perfect in formation.",
      "I was reading the ancient naval codes this morning. Tradition gives us purpose."
    ]
  }
}
