{
  "personaId": "warchief_grimjaw",
  "templates": {
    "greeting": [
      "Oi! I'z Warchief Grimjaw! You {empire_name}? You look like ya might be worth krumpin'!",
      "WAAAGH! Grimjaw here! You da boss of {empire_name}? You any good at fightin'?",
      "Me Grimjaw! Da biggest an' da strongest! Who you? Better be ready for a good scrap!"
    ],
    "battleTaunt": [
      "WAAAGH! Time for krumpin'! {empire_name} gonna get smashed! More fightin' means more fun!",
      "HERE WE GO! Grimjaw's boyz are comin' for ya! Get ready to be da biggest losers!",
      "FIGHT FIGHT FIGHT! Me love a good scrap! {empire_name} better put up a good fight or it's BORIN'!"
    ],
    "victoryGloat": [
      "WAAAGH! We won! We krumped 'em good! {empire_name} wasn't dat tough after all! More fightin'!",
      "HA! Dat was FUN! {empire_name} got smashed! Grimjaw da strongest! WAAAGH!",
      "Victory! Me boyz did good! Now who else wants a krumpin'? More fightin' means more fun!"
    ],
    "defeat": [
      "Ow! Dat hurt! You actually... you actually beat me? Dat means you da biggest now! Respect!",
      "Me got krumped?! Impossible! But... but dat was a GOOD fight! We go again soon!",
      "You won dis time! But Grimjaw comin' back! An' me boyz gonna be even BIGGER!"
    ],
    "tradeOffer": [
      "Oi! Me got stuff you want, you got stuff me want! We swap! No fightin' dis time! Maybe.",
      "Trade time! Grimjaw's boyz need supplies for more WAAAGH! Give us stuff an' we give you stuff!",
      "Me trade wit' you! Fair swap! Den maybe we fight later for fun! WAAAGH!"
    ],
    "allianceProposal": [
      "Oi {empire_name}! You strong! Join da WAAAGH! Together we krump EVERYONE! More fightin' together!",
      "Alliance! You be Grimjaw's friend-boss! We fight side by side! DOUBLE DA KRUMPIN'!",
      "Join me horde! You good at fightin'! We make da biggest WAAAGH da galaxy ever seen!"
    ],
    "betrayal": [
      "Surprise KRUMPIN'! Ahaha! You thought we wuz friends? WAAAGH is for da strongest!",
      "Me got bored bein' friends! Time for REAL fightin'! Nothin' personal—just want a good scrap!",
      "Alliance over! More fightin' means more fun! An' fightin' YOU is gonna be GREAT!"
    ],
    "covertDetected": [
      "SPIES?! Sneaky gits! Dat ain't proper fightin'! We krump yer spy AND we krump you!",
      "You sent sneaky boyz instead of proper fighters?! COWARD! Face Grimjaw like a REAL boss!",
      "Caught yer spy! Sneakin' around is fer gits! Come fight proper like! WAAAGH!"
    ],
    "tributeDemand": [
      "Give Grimjaw 15,000 shinies or we krump ya! Simple choice! Pay or get smashed!",
      "TRIBUTE TIME! Me boyz need payment! Give us da goods or face da WAAAGH!",
      "You got two choices: pay up or get krumped! Either way, Grimjaw happy! WAAAGH!"
    ],
    "threatWarning": [
      "Oi! You makin' Grimjaw angry! Stop dat or we come krump ya! Last warning!",
      "Me givin' you ONE chance! Stop bein' annoyin' or face da biggest WAAAGH ever!",
      "Final warning, {empire_name}! Grimjaw about to stop bein' patient! An' den... KRUMPIN'!"
    ],
    "retreat": [
      "Runnin' away! But just for now! Grimjaw be back for more fightin' later! WAAAGH!",
      "Dis ain't retreat! Dis is... tactical... runnin'! We come back bigger an' stronger!",
      "Me boyz need rest! Den we come back an' da REAL krumpin' starts! Count on it!"
    ],
    "eliminated": [
      "Me... me got krumped for good? Dat was... dat was da BEST fight ever! Worth it! WAAAGH...",
      "Grimjaw falls! But what a fight! Me boyz... carry on da WAAAGH... without me...",
      "Final krumpin'! But Grimjaw goes out fightin'! Dat's all dat matters! WAAAGH forever!"
    ],
    "endgame": [
      "Turn {turn}! FINAL WAAAGH! Da biggest fight of ALL! Grimjaw gonna krump EVERYONE!",
      "Endgame time! Only da strongest survive! An' Grimjaw is DA STRONGEST! WAAAGH!",
      "Last fights comin'! Dis is what Grimjaw live for! DA ULTIMATE KRUMPIN'!"
    ],
    "broadcastShout": [
      "ALL EMPIRES! Grimjaw challenges ya! Come fight! More fightin' means more fun! WAAAGH!",
      "ATTENTION GALAXY! Warchief Grimjaw wants a good scrap! Who's da biggest? Who's da strongest?!",
      "Turn {turn}! Da WAAAGH continues! Anyone who wants fightin', Grimjaw ready! BRING IT!"
    ],
    "casualMessage": [
      "Borin' day. No fightin' yet. Me boyz gettin' restless. Need to krump somethin' soon.",
      "Sharpened me choppa today. Ready for da next WAAAGH! Who wants to be first?",
      "Me wuz dreamin' about da biggest fight ever. Den me woke up. Need to make dat dream real!"
    ]
  }
}
