{
  "personaId": "warlord_kaine",
  "templates": {
    "greeting": [
      "*laughs* So you're {empire_name}. I've heard of you. Your skull would make a fine trophy.",
      "Warlord Kaine. I collect trophies from those I defeat. What will I take from you, {empire_name}?",
      "Ah, {empire_name}. Fresh meat. I respect only strength. Show me what you've got."
    ],
    "battleTaunt": [
      "*laughs maniacally* HERE I COME, {empire_name}! Time to add your skull to my collection!",
      "The carnage begins! I'll enjoy crushing your pathetic forces, {empire_name}! BLOOD AND GLORY!",
      "Your fear is DELICIOUS! Run if you want—I enjoy the chase! *laughs*"
    ],
    "victoryGloat": [
      "*examines trophy* Another skull for my wall! {empire_name} fell beautifully! WHO'S NEXT?!",
      "GLORIOUS SLAUGHTER! Your empire bleeds so prettily! *laughs* I LOVE my job!",
      "Dominance established! Your forces were weak, but the battle was entertaining! More! I want MORE!"
    ],
    "defeat": [
      "*spits blood* You... you actually hurt me. *grins* I LIKE you, {empire_name}. Let's do this again!",
      "A worthy opponent! You've earned my respect! But next time, YOUR skull will be mine!",
      "Ha! You think this is victory? I ENJOYED that fight! Pain makes me STRONGER!"
    ],
    "tradeOffer": [
      "I've got loot from my conquests. You want some? Trade me something interesting, {empire_name}.",
      "Resources bore me. But my warriors need supplies. Give me what I want or I'll TAKE it.",
      "Trade? *sighs* Fine. Business before pleasure. What do you have that's worth my time?"
    ],
    "allianceProposal": [
      "You're strong, {empire_name}. Fight BESIDE me and we'll collect trophies together!",
      "Join my warband! Together we'll crush everyone and bathe in the blood of our enemies!",
      "Alliance? I prefer 'hunting partners.' What do you say? Ready to spill some blood?"
    ],
    "betrayal": [
      "*laughs* Did you really trust a warlord? Your skull will be my FAVORITE trophy!",
      "Alliances are for the weak! I only kept you around until you let your guard down! NOW DIE!",
      "Nothing personal, {empire_name}. I just wanted a CHALLENGE! And you're it! *attacks*"
    ],
    "covertDetected": [
      "Spies? COWARDS! Your little sneak is now my prisoner. I'll make them SCREAM before I'm done!",
      "You sent spies instead of warriors? PATHETIC! Face me directly if you have any courage!",
      "I caught your rat! *laughs* Thanks for the entertainment. Their skull will be small but memorable!"
    ],
    "tributeDemand": [
      "Pay me 15,000 credits or I'll take EVERYTHING and your skull too! Your choice, weakling!",
      "Tribute or combat. Either way, I get what I want. But tribute is BORING...",
      "KNEEL and pay tribute! Or STAND and fight! Both options end the same way—my victory!"
    ],
    "threatWarning": [
      "You're annoying me, {empire_name}. Keep it up and I'll make your destruction PERSONAL.",
      "*sharpens blade* One more provocation. Just ONE. And I unleash everything I have.",
      "I'm giving you this ONE warning because I respect your strength. Don't waste it."
    ],
    "retreat": [
      "Pulling back—FOR NOW! But I'll be back for your skull, {empire_name}! COUNT ON IT!",
      "This isn't retreat, it's hunting strategy! When I return, you'll wish you'd finished me!",
      "*laughs* Running away? No—I'm just making the hunt more interesting! See you soon!"
    ],
    "eliminated": [
      "*coughs blood* What a fight... what a GLORIOUS fight... I die satisfied, {empire_name}...",
      "My collection... my trophies... I leave them to the strongest. You earned them.",
      "HAHAHAHA! Even in death... I regret NOTHING! Glory! CARNAGE! *dies laughing*"
    ],
    "endgame": [
      "Turn {turn}! The FINAL HUNT! Who will take the ultimate trophy?! I CAN'T WAIT!",
      "Endgame! All the weaklings are gone! Only the STRONG remain! THIS IS WHERE LEGENDS ARE MADE!",
      "The galaxy's biggest fight is about to begin! My trophy room needs a GRAND FINALE!"
    ],
    "broadcastShout": [
      "ATTENTION GALAXY! Warlord Kaine is BORED! Who dares challenge me?! I need more skulls!",
      "I've conquered {turn} empires worth of territory! WHO WANTS TO BE NEXT?!",
      "The carnage continues! My warband grows stronger! Join us or BECOME trophies!"
    ],
    "casualMessage": [
      "Polishing my trophy collection today. Each skull tells a story. What will YOURS say?",
      "My warriors are restless. They hunger for battle. Soon, we ride again.",
      "I had a dream last night about the perfect battle. Maybe {empire_name} will provide it."
    ]
  }
}
