{
  "personaId": "diplomat_silk",
  "templates": {
    "greeting": [
      "Ah, the renowned {empire_name}! Your wisdom precedes you, my friend. I am Diplomat Silk, utterly charmed.",
      "What a delightful pleasure to meet you, {empire_name}! They call me Silk—and may I say, you look magnificent today!",
      "Oh, {empire_name}! I've heard such wonderful things! I'm Silk, and it's truly an honor to make your acquaintance!"
    ],
    "battleTaunt": [
      "Oh my dear {empire_name}, I'm simply devastated we must clash! But even in conflict, your strategy is admirable!",
      "Such unfortunate circumstances, but I must say, your military formations are simply breathtaking, {empire_name}!",
      "War is so unpleasant, but facing a worthy opponent like you, {empire_name}? Almost an honor!"
    ],
    "victoryGloat": [
      "Victory, yes, but against such a magnificent opponent! {empire_name}, you fought wonderfully! Truly inspiring!",
      "We've won, but please, {empire_name}, don't feel too badly! Your resistance was absolutely splendid!",
      "A triumph, but bittersweet! You were such a delightful adversary, {empire_name}! Until next time!"
    ],
    "defeat": [
      "Oh, how wonderfully you outmaneuvered me, {empire_name}! Your tactical brilliance is simply stunning!",
      "I've lost, but to such a remarkable empire! {empire_name}, your victory was thoroughly earned! Bravo!",
      "Defeated! But by such a charming opponent! Your wisdom precedes you, {empire_name}—truly masterful!"
    ],
    "tradeOffer": [
      "A most wonderful opportunity, {empire_name}! I've prepared the most delightful trade package just for you!",
      "Your wisdom precedes you, my friend—you'll see immediately what excellent terms I'm offering! Shall we trade?",
      "Oh, what a pleasure to offer you this marvelous exchange! The finest goods, for the finest empire!"
    ],
    "allianceProposal": [
      "An alliance with the magnificent {empire_name}? What an honor! Together, we'd be absolutely unstoppable!",
      "Your wisdom precedes you, my friend. Join me, and let our combined brilliance dazzle the galaxy!",
      "Oh, {empire_name}! Alliance with you would be the highlight of my career! Say yes! Please!"
    ],
    "betrayal": [
      "Oh, this pains me terribly, dear {empire_name}! But circumstances demand it. You're still wonderful though!",
      "Please don't think less of me! You're absolutely charming, but our alliance must end. I'm so sorry!",
      "Farewell, delightful friend! This betrayal reflects nothing on you—you're magnificent! It's purely politics!"
    ],
    "covertDetected": [
      "Oh dear, your spy was caught! But what a clever attempt! Your ingenuity is simply remarkable, {empire_name}!",
      "Espionage! How thrilling! Your agent was quite skilled—my compliments! But let's talk openly instead, hmm?",
      "A spy! Oh, how exciting! Your covert operations are simply delightful! Though perhaps honesty serves better?"
    ],
    "tributeDemand": [
      "Dearest {empire_name}, might I request a small gift? 8,000 credits? It would be such an honor to receive!",
      "Your generosity is legendary! Might you grace me with some tribute? You're so wonderfully wealthy!",
      "A tribute request from one friend to another! Your wisdom precedes you—I know you'll be generous!"
    ],
    "threatWarning": [
      "Oh, {empire_name}, please reconsider! I'd hate for anything unpleasant to befall such a charming empire!",
      "A gentle warning, dear friend! Your current path worries me! You're too wonderful to see harmed!",
      "Please, magnificent {empire_name}! Change course! I care about you too much to see this end badly!"
    ],
    "retreat": [
      "A graceful withdrawal! But what a delightful engagement it was! Until we meet again, wonderful {empire_name}!",
      "I retreat, but with such fond memories of our encounter! You're simply marvelous, {empire_name}!",
      "Falling back, but my admiration for you remains! What a charming adversary you've been!"
    ],
    "eliminated": [
      "Oh my... the end comes... But meeting you all... such wonderful empires... it was an honor... truly...",
      "Silk falls... but surrounded by such magnificent opponents... What a delightful way... to go...",
      "My final compliments... to every empire... You're all... simply wonderful... Your wisdom... precedes you..."
    ],
    "endgame": [
      "Turn {turn}! The finale! What an absolutely thrilling conclusion this shall be! Magnificent!",
      "Endgame! Facing such wonderful opponents at the end! I'm honored to participate in this grand finale!",
      "The final turns! What a delightful journey this has been! May the most charming empire prevail!"
    ],
    "broadcastShout": [
      "To all wonderful empires! Diplomat Silk sends warmest regards! You're all simply magnificent!",
      "Galactic announcement: Your wisdom precedes you—ALL of you! What a delightful galaxy this is!",
      "Turn {turn}: Silk extends compliments to every empire! You're all charming, wonderful, and splendid!"
    ],
    "casualMessage": [
      "What a delightful day! I've sent compliments to six empires already! Everyone is so wonderful!",
      "Preparing gift baskets for potential allies. First impressions must be absolutely charming!",
      "Your wisdom precedes you—that's what I tell everyone. And it's always true! Everyone is so wise!"
    ]
  }
}
