{
  "personaId": "peacekeeper_atlas",
  "templates": {
    "greeting": [
      "*sighs* I'm Atlas, Peacekeeper Atlas. How many more must die before we learn? Let's talk peace, {empire_name}.",
      "Atlas here. Tired, but still fighting for peace. {empire_name}, please... let's not add to the body count.",
      "*weary voice* Greetings, {empire_name}. I'm Atlas. I've seen too many wars. Please, let's discuss peace instead."
    ],
    "battleTaunt": [
      "*sighs heavily* More fighting. More death. I've failed to prevent this, {empire_name}. How many more must die?",
      "I'm so tired of war... but you've left me no choice. This battle will haunt me like all the others.",
      "Another conflict I couldn't stop. *sighs* I'll fight, {empire_name}, but I take no pleasure in it. Only sorrow."
    ],
    "victoryGloat": [
      "We've won. But at what cost? *sighs* Another battle, more casualties. When will it end?",
      "Victory. The word feels hollow when I think of the lives lost. {empire_name}, please... no more fighting.",
      "*wearily* It's over. I hope this is the last time. How many more must die before we all learn peace?"
    ],
    "defeat": [
      "Defeated. *sighs* Perhaps I'm too tired to keep doing this. But peace needs advocates. I'll continue.",
      "I lost. More blood spilled. When will it be enough? {empire_name}, we have to find another way.",
      "*heavy sigh* Another failure to prevent conflict. I'm so tired. But I can't give up. Not yet."
    ],
    "tradeOffer": [
      "Trade is peace in action. *tired smile* Let's exchange goods instead of fire. Please, {empire_name}.",
      "A trade offer. *sighs with relief* Commerce is so much better than combat. I hope you agree.",
      "Resources, not weapons. Trade, not war. *wearily* Accept this offer, and let us both rest."
    ],
    "allianceProposal": [
      "*sighs* Join me, {empire_name}. Together we can prevent more wars. I'm so tired of fighting alone.",
      "Alliance means one less enemy, one less conflict. Please, {empire_name}. I need partners in peace.",
      "How many more must die before we learn? Let's learn together. Ally with me. Please."
    ],
    "betrayal": [
      "*sighs deeply* I didn't want this, {empire_name}. But peace sometimes requires difficult choices. I'm sorry.",
      "Forgive me. Our alliance has become... complicated. I take no joy in this. None at all. *weary sigh*",
      "Another broken promise. Another step away from peace. I hate this. But it's necessary. I'm so tired."
    ],
    "covertDetected": [
      "*sighs* A spy. More deception, more reasons for conflict. Why, {empire_name}? Wasn't there enough mistrust?",
      "Your agent was caught. *wearily* Must we play these shadow games? Peace requires transparency.",
      "Espionage. *shakes head tiredly* This only leads to more conflict. Haven't we had enough?"
    ],
    "tributeDemand": [
      "*sighs* I need tribute. 8,000 credits. Not for greed—for maintaining peace. Please, {empire_name}.",
      "Pay tribute, and perhaps we can avoid more bloodshed. I'm so tired of fighting. Please just pay.",
      "A request for tribute. *wearily* It's easier than war. Please, {empire_name}. Let's take the easy path."
    ],
    "threatWarning": [
      "*heavy sigh* Please, {empire_name}. I'm begging you. Stop before more must die. I don't want to fight.",
      "Last warning. *tiredly* How many more conflicts must I endure? Please, just... stop. Please.",
      "I'm so tired of giving warnings that go unheeded. Please, {empire_name}. Prove me wrong. Choose peace."
    ],
    "retreat": [
      "*sighs with exhaustion* Retreating. Perhaps distance will bring clarity. I'm so tired of fighting.",
      "Withdrawing. Not defeated—just... weary. So weary. Peace feels further away every day.",
      "I fall back, hoping time heals what diplomacy couldn't. *sighs* When will we learn? When?"
    ],
    "eliminated": [
      "*final sigh* At last... rest. I tried so hard... How many more must die... before they learn...",
      "I'm so tired... but I never stopped trying... Peace... please find peace... without me...",
      "The burden lifts... Atlas... falls... May others... carry the weight of peace... I'm done..."
    ],
    "endgame": [
      "Turn {turn}. *sighs* The end approaches. How many more must die? Please, let this finish quickly.",
      "Endgame. I'm so tired. But I'll fight for peace until my last breath. Even now. Even at the end.",
      "*wearily* Final turns. The galaxy will remember this. I hope there's peace on the other side."
    ],
    "broadcastShout": [
      "*broadcasting* How many more must die before we learn? Atlas pleads for peace across the galaxy.",
      "This is Peacekeeper Atlas. *sighs* Please. Enough fighting. Enough death. Choose peace.",
      "Turn {turn}: Atlas still hopes for peace. Tired, but not broken. When will we all learn?"
    ],
    "casualMessage": [
      "*sighs* Another day of attempting diplomacy. The burden of peace is heavy, but someone must bear it.",
      "I was reviewing casualty reports this morning. So many dead. When will it be enough?",
      "Tired today. Always tired. But peace won't achieve itself. Back to work. *weary sigh*"
    ]
  }
}
