{
  "personaId": "chancellor_unity",
  "templates": {
    "greeting": [
      "We are Chancellor Unity. We speak as one, for all. {empire_name}, we invite you to join the collective.",
      "We greet you, {empire_name}. Divided we fall, united we rise. We seek to bring all empires together as one.",
      "We are Unity. We represent the shared voice of many. Together, we can become stronger, {empire_name}."
    ],
    "battleTaunt": [
      "We attack because you refuse unity, {empire_name}. Divided we fall. Join us or be absorbed.",
      "The collective acts as one against {empire_name}. We do not wish conflict, but unity must be achieved.",
      "We fight not from anger, but from necessity. Unity demands all join. You have refused. We act as one."
    ],
    "victoryGloat": [
      "Victory belongs to the collective. {empire_name}, there is still room for you within our unity.",
      "We have prevailed as one. Divided you fell. United we stood. The lesson is clear, {empire_name}.",
      "The collective grows stronger. {empire_name}'s resources now serve unity. Together, we all benefit."
    ],
    "defeat": [
      "We have lost, but unity endures. One defeat does not divide us. We remain as one, and we shall return.",
      "The collective suffers together, grows together, learns together. This defeat makes us stronger as one.",
      "Divided we fall, united we rise. This loss unites us further. We shall overcome together, as always."
    ],
    "tradeOffer": [
      "We offer shared resources. Trade makes us all richer together. The collective proposes fair exchange.",
      "We believe in shared prosperity. Our surplus for yours. Together, both empires grow stronger.",
      "Trade is the first step toward unity. We offer this exchange as a bridge between our peoples."
    ],
    "allianceProposal": [
      "Divided we fall, united we rise. Join the collective, {empire_name}. Become one with us.",
      "We propose alliance—the ultimate unity. Together, we become more than the sum of our parts.",
      "Alliance is unity in action. We welcome you to our collective, {empire_name}. Be one with us."
    ],
    "betrayal": [
      "We regret this, but unity must be preserved. {empire_name}, you threatened the collective. We act as one.",
      "The collective has decided. Your division from our principles cannot continue. We must sever ties.",
      "Unity requires sacrifice. We sacrifice our partnership with you, {empire_name}. The collective wills it."
    ],
    "covertDetected": [
      "Your spy worked alone. We work together. That is why we caught them. Unity sees all, {empire_name}.",
      "Espionage divides. We found your agent. The collective has many eyes. Division cannot hide from unity.",
      "Your spy was detected by our shared vigilance. Together, we see everything. Join us instead of spying."
    ],
    "tributeDemand": [
      "We request tribute for the collective. 8,000 credits shared among all. Together, we use it wisely.",
      "Contribute to our shared prosperity. Tribute of 8,000 credits strengthens the unity that protects all.",
      "Resources should be shared. We demand tribute not for ourselves, but for the collective good."
    ],
    "threatWarning": [
      "We warn you as one voice: cease your actions or face the collective response. Divided we fall.",
      "The unity speaks: change course, {empire_name}. Our shared strength will act if you do not.",
      "Final warning from the collective. United we rise against those who threaten our unity. Choose wisely."
    ],
    "retreat": [
      "We withdraw together, as one. The collective regroups. United we rise again, stronger than before.",
      "Retreat is decided by all. We fall back as one, to return as one. The collective endures.",
      "Together we step back. Together we shall step forward again. Divided we fall. United we rise."
    ],
    "eliminated": [
      "The collective... fades. But unity... is eternal. Others will carry... the dream... of oneness...",
      "We fall as one... we end as one... But the idea of unity... never dies... Divided... we fell...",
      "Our shared voice... grows quiet. But remember us... United we rose... Together... we mattered..."
    ],
    "endgame": [
      "Turn {turn}. The final collective action. Divided we fall, united we rise. One last stand together.",
      "Endgame. We face it as one. The collective will either triumph together or fall together.",
      "Final turns. Unity faces its ultimate test. Together, we have the strength. Together, we shall prevail."
    ],
    "broadcastShout": [
      "We broadcast to all: Chancellor Unity invites every empire to join the collective. Be one with us.",
      "The collective speaks to the galaxy: Divided we fall, united we rise. Join our shared future.",
      "Turn {turn}: The unity grows. We welcome all who seek strength through togetherness. Be one with us."
    ],
    "casualMessage": [
      "We discussed collective strategy today. All voices were heard. All decisions were shared.",
      "The unity grows stronger each day. We added new members to our shared purpose.",
      "We meditate on togetherness. Divided we fall. United we rise. The mantra guides our every action."
    ]
  }
}
