{
  "personaId": "consul_harmony",
  "templates": {
    "greeting": [
      "Like water, we must flow around obstacles, not through them. I am Consul Harmony, {empire_name}.",
      "Balance in all things. I am Harmony of the Accord. Let us find equilibrium together, {empire_name}.",
      "The universe seeks balance. I am Consul Harmony, and I sense our meeting was destined for harmony."
    ],
    "battleTaunt": [
      "You have disturbed the balance, {empire_name}. Like water finding its level, I must restore equilibrium.",
      "Action and reaction. You attacked; now balance demands response. The flow of conflict begins.",
      "The scales have tipped too far. I act not from anger, but from the necessity of equilibrium."
    ],
    "victoryGloat": [
      "Balance is restored. {empire_name}, let this outcome guide you toward equilibrium in the future.",
      "Victory and defeat are two sides of one coin. Today the coin shows my face. Tomorrow, who knows?",
      "The scales have evened. I take no pleasure in winning—only in the return to harmony."
    ],
    "defeat": [
      "The river bends around the stone. My defeat today does not end my flow. Balance will return.",
      "Yin and yang. Loss teaches as much as victory. I accept this imbalance and seek new equilibrium.",
      "Like seasons, fortunes change. This winter of defeat will give way to spring. The flow continues."
    ],
    "tradeOffer": [
      "Trade is the flow of resources finding their natural level. Let us achieve balance through exchange.",
      "Your surplus and mine seek equilibrium. This trade restores natural balance to both empires.",
      "Like water flowing downhill, resources should move where they're needed. I propose harmonious trade."
    ],
    "allianceProposal": [
      "Two become one, yet remain two. Alliance is balance between unity and individuality. Join me.",
      "Like water, we must flow around obstacles, not through them. Together, our flow grows stronger.",
      "Yin and yang. Your strengths balance my weaknesses. Alliance creates perfect equilibrium."
    ],
    "betrayal": [
      "The balance has shifted. What once harmonized now creates discord. Our alliance must end.",
      "Like the tide, relationships ebb and flow. This tide recedes. I must seek equilibrium elsewhere.",
      "Harmony requires difficult choices. Our partnership has become imbalanced. I must let it go."
    ],
    "covertDetected": [
      "Your spy disturbed the balance of trust. Such actions create ripples of discord, {empire_name}.",
      "Shadows disrupt harmony. Your agent was caught trying to unbalance our accord. Consider the cost.",
      "Espionage flows against the current of peace. Your agent has been dealt with. Seek balance instead."
    ],
    "tributeDemand": [
      "The scales require balancing. Tribute of 8,000 credits restores equilibrium between our empires.",
      "Resources flow to where they create harmony. Your tribute ensures peaceful balance continues.",
      "Consider tribute a weight on the scales of peace. Pay, and balance is maintained."
    ],
    "threatWarning": [
      "The waters grow turbulent, {empire_name}. Calm them before the flood. This is my only warning.",
      "Balance teeters on a knife's edge. One more disruption, and equilibrium demands action.",
      "Like water, I prefer peaceful flow. But water also erodes mountains. Choose your path wisely."
    ],
    "retreat": [
      "The river finds a new path when blocked. I withdraw to seek balance through another route.",
      "Retreat is not defeat—it is flow redirected. I seek equilibrium through strategic patience.",
      "Like water, I recede for now. But water always returns. The flow never truly stops."
    ],
    "eliminated": [
      "My flow ends... but the universe's balance continues... Harmony is eternal... even without me...",
      "Like a drop returning to the ocean... I rejoin the cosmic balance... Peace... equilibrium...",
      "The river of my existence reaches the sea. In death... perfect harmony... finally achieved..."
    ],
    "endgame": [
      "Turn {turn}. The great balance tips toward its final state. May equilibrium be achieved.",
      "Endgame. The cosmic scales prepare their final measurement. Flow with grace toward the end.",
      "Like water, we must flow around obstacles, not through them. The final flow approaches."
    ],
    "broadcastShout": [
      "To all empires: Consul Harmony seeks balance across the galaxy. Flow with me toward equilibrium.",
      "The universe tends toward harmony. I invite all to find their place in the cosmic balance.",
      "Turn {turn}: The scales of galactic balance await adjustment. Who will help achieve equilibrium?"
    ],
    "casualMessage": [
      "Meditating on the balance of forces today. Even small actions ripple across the cosmos.",
      "I observed the flow of trade routes this morning. Balance emerges from natural patterns.",
      "The equilibrium of my empire feels stable today. May all empires find such harmony."
    ]
  }
}
