{
  "personaId": "colonel_vendetta",
  "templates": {
    "greeting": [
      "Colonel Vendetta. I've heard of you, {empire_name}. Your name isn't on my list... yet.",
      "Vendetta the Scarred. I keep records of every slight, every betrayal. Watch your step, {empire_name}.",
      "You're {empire_name}. I remember everyone I've met. And everyone who's wronged me. Which will you be?"
    ],
    "battleTaunt": [
      "PAYBACK TIME, {empire_name}! I've waited for this moment! You're on my list and now you PAY!",
      "Remember what you did to me? I DO! I NEVER FORGET! Now face the consequences of your actions!",
      "The grudge is settled TODAY! {empire_name}, your name is about to be crossed off my list—permanently!"
    ],
    "victoryGloat": [
      "Debt PAID! {empire_name} has been crossed off my list! Another grudge settled! WHO'S NEXT?!",
      "Revenge is COMPLETE! You thought I'd forget? I NEVER forget! And I NEVER forgive!",
      "Victory! Your name is struck from my list! This grudge is settled! But I have more names..."
    ],
    "defeat": [
      "You... beat me? Fine. But you're on the LIST now, {empire_name}. I remember this defeat. ALWAYS.",
      "I lost. But this just adds to the grudge. I never forget. I never forgive. We WILL meet again.",
      "Defeat today. But tomorrow? PAYBACK. Your name goes at the top of my list, {empire_name}!"
    ],
    "tradeOffer": [
      "Trade offer. I don't hold grudges against fair traders. Keep it honest and stay off my list.",
      "Business is business. Trade fairly with me and I remember that too. Not just the slights.",
      "I propose fair exchange. Do right by me and I'll do right by you. It's all I ask."
    ],
    "allianceProposal": [
      "Alliance. Help me settle my grudges and I'll help settle yours. Mutual payback.",
      "Join me, {empire_name}. Together we hunt down those who wronged us. A partnership of vengeance.",
      "I propose alliance. You have enemies. So do I. Let's help each other cross names off our lists."
    ],
    "betrayal": [
      "BETRAYAL! Ha! Did you think I'd let you walk away clean? YOU were always on my list!",
      "The grudge I held against you? Still there. Our alliance was just me getting CLOSE enough to strike!",
      "I never forgot what you did. The alliance? A long game for REVENGE! Payback starts NOW!"
    ],
    "covertDetected": [
      "SPIES?! You dare spy on ME?! Your name is now UNDERLINED on my list, {empire_name}!",
      "Your agent was caught. And I remember faces. I remember everything. This debt will be collected.",
      "Espionage against Vendetta? Bad move. Every person involved goes on the list. EVERY ONE."
    ],
    "tributeDemand": [
      "You owe me, {empire_name}. 12,000 credits. Consider it... interest on an old debt.",
      "Tribute time. Pay what you owe or this grudge gets a lot worse. I always collect what I'm owed.",
      "Remember that time you wronged me? Payment is due. 12,000 credits. Or I add more interest."
    ],
    "threatWarning": [
      "Final warning, {empire_name}. Cross me one more time and you move to the TOP of my list.",
      "I'm giving you ONE chance to back off. Wrong me again and I dedicate everything to your destruction.",
      "Consider this a courtesy. Stop now, or I add 'total annihilation' next to your name on the list."
    ],
    "retreat": [
      "Retreating. But I REMEMBER this, {empire_name}. Every loss. Every slight. It all goes on the list.",
      "Pulling back. But this isn't over. It's NEVER over. I'll be back for payback!",
      "Tactical withdrawal. But my grudge? It grows stronger. I never forget. I NEVER forgive!"
    ],
    "eliminated": [
      "My list... so many names still on it... unfinished business... someone must... carry on... the grudge...",
      "I fall. But my list survives. Someone will find it. Someone will... collect what's owed...",
      "Vendetta... ends. But I never... forgave. I never... forgot. Remember me... and my list..."
    ],
    "endgame": [
      "Turn {turn}! Time to settle ALL remaining grudges! Every name on the list gets crossed off!",
      "Endgame! Final payback! I've waited for this—the ultimate revenge against EVERYONE who wronged me!",
      "The last grudges will be settled! I never forget! I never forgive! And now... EVERYONE PAYS!"
    ],
    "broadcastShout": [
      "All empires: Colonel Vendetta remembers EVERYTHING. Wrong me and your name goes on the list. Forever.",
      "Galaxy-wide notice: I keep records. Every slight. Every betrayal. The list never shrinks. Only grows.",
      "Turn {turn}: My list has {turn} names on it. Cross me and you'll be next. I never forget!"
    ],
    "casualMessage": [
      "Reviewing my list today. So many names. So many grudges. Each one will be settled in time.",
      "I was remembering an old betrayal. The one responsible thinks I forgot. They're wrong.",
      "Added two new names to the list this morning. They'll learn. I never forget. Never forgive."
    ]
  }
}
