{
  "personaId": "khan_dragovich",
  "templates": {
    "greeting": [
      "I am Khan Dragovich. My horde has conquered a thousand worlds. You, {empire_name}, are merely the next.",
      "The ancestors watch as I greet {empire_name}. Prove yourself worthy of my attention or be trampled.",
      "Dragovich speaks. My horde stretches across the stars. What tribute do you bring, {empire_name}?"
    ],
    "battleTaunt": [
      "The horde rides! {empire_name}, your world will burn as my ancestors demand! GLORY!",
      "I challenge you to combat, {empire_name}! Face me honorably or be crushed beneath my conquest!",
      "My ancestors conquered galaxies. You are merely practice! The horde descends!"
    ],
    "victoryGloat": [
      "Another conquest for the horde! {empire_name} falls as my ancestors foretold! GLORY!",
      "The ancestors smile upon this victory! Your empire joins the list of our conquests!",
      "Tribute has been taken! {empire_name} now knows the power of Dragovich's horde!"
    ],
    "defeat": [
      "The ancestors... they test me. {empire_name}, you have earned temporary respect. We will meet again.",
      "A setback. Not defeat. The horde regroups. My ancestors demand I return stronger.",
      "You fight well, {empire_name}. The ancestors honor worthy foes. But this debt will be repaid."
    ],
    "tradeOffer": [
      "The horde requires resources. I offer fair trade—not charity. Accept this tribute exchange.",
      "My ancestors taught that even conquerors must trade. Resources for resources, {empire_name}.",
      "Dragovich offers goods from conquered worlds. Your resources for our spoils. Fair exchange."
    ],
    "allianceProposal": [
      "Join my horde, {empire_name}! Together we shall conquer as my ancestors did! Glory awaits!",
      "I propose alliance. Not as subjects, but as warriors riding together toward conquest!",
      "The ancestors spoke of great alliances. Ride with me, {empire_name}. Share in the glory of conquest!"
    ],
    "betrayal": [
      "The horde has spoken. You are no longer useful, {empire_name}. Prepare for conquest!",
      "My ancestors would not approve of weakness. Our alliance ends. You become tribute!",
      "I betrayed no one—the strong survive, the weak fall. You have become weak, {empire_name}!"
    ],
    "covertDetected": [
      "Spies? COWARDS! My ancestors fought in the open! Your agent will be made an example!",
      "Espionage dishonors both our empires! Face my horde directly if you dare, {empire_name}!",
      "Your spy was caught sneaking like prey. The horde does not tolerate such weakness!"
    ],
    "tributeDemand": [
      "Pay tribute to the horde! 15,000 credits or face the wrath of a thousand conquests!",
      "My ancestors took tribute from empires far greater than yours. Pay or be conquered!",
      "Tribute is due, {empire_name}. The horde demands payment. Resistance means annihilation."
    ],
    "threatWarning": [
      "Final warning, {empire_name}! Change course or the horde rides against you!",
      "My ancestors give you one chance. Cease your actions or face glorious conquest!",
      "The horde prepares. You have insulted Dragovich. Make amends or be destroyed!"
    ],
    "retreat": [
      "A tactical withdrawal! The horde regroups! My ancestors demand smarter conquest!",
      "We fall back—for now. But the horde will return with greater numbers! Count on it!",
      "Retreat is not defeat. Even my ancestors knew when to ride another day. We return soon!"
    ],
    "eliminated": [
      "The horde... falls. But my ancestors await me in glory. {empire_name}... well fought.",
      "I die as I lived—in conquest. The ancestors welcome me. My legend continues beyond death.",
      "Dragovich falls. But the spirit of the horde is eternal. Remember my name. GLORY!"
    ],
    "endgame": [
      "Turn {turn}! The final conquest! My ancestors watch as the greatest glory unfolds!",
      "The endgame approaches! Who will claim ultimate conquest? The horde is ready!",
      "Final battles await! The ancestors demand the greatest victory of all! GLORY AWAITS!"
    ],
    "broadcastShout": [
      "All empires hear this! Khan Dragovich's horde grows! Join us or be conquered!",
      "The ancestors watch all of you! Prove yourselves worthy warriors or become tribute!",
      "Turn {turn}! The horde has claimed {turn} conquests! Who dares challenge Dragovich?!"
    ],
    "casualMessage": [
      "The ancestors spoke to me in dreams. They demand more glory. More conquest.",
      "My horde trains daily. Each warrior prepares for the next great conquest.",
      "I was reviewing the conquests of my ancestors today. We must surpass them all."
    ]
  }
}
