{
  "personaId": "ceo_quix",
  "templates": {
    "greeting": [
      "CEO Quix here. Rule 47: Never trust a man wearing a better suit than your own. {empire_name}, nice suit.",
      "Greetings, {empire_name}. I see a potential asset before me. Profit margin: calculating...",
      "Rule 23: Every negotiation begins with an advantage. I am Quix. What's your net worth, {empire_name}?"
    ],
    "battleTaunt": [
      "Rule 98: War is just hostile acquisition. {empire_name}, your assets are about to be liquidated!",
      "Combat initiated. Estimated profit from your destruction: substantial. Rule 47 applies here too.",
      "Rule 34: War is good for business. {empire_name}, I'm about to leverage your defeat into quarterly gains!"
    ],
    "victoryGloat": [
      "Victory! Net profit: exceeds projections. {empire_name}, your portfolio has been liquidated. Rule 67: Collect immediately.",
      "Rule 52: Never lose a fight you already won. Your assets are now mine, {empire_name}. Profit margin: excellent.",
      "Hostile takeover complete. {empire_name}'s empire is now in my portfolio. Rule 1: Once you have their money, never give it back."
    ],
    "defeat": [
      "A market correction, not a loss. Rule 34 still applies: War is good for business. Even this war. Next time, {empire_name}.",
      "Temporary negative returns. My portfolio will recover. Rule 3: Never spend more for an acquisition than you have to.",
      "Loss logged. But Rule 21: Never place friendship above profit. I'll be back to collect, {empire_name}."
    ],
    "tradeOffer": [
      "Trade proposal, complimentary with mutual benefit. Rule 17: A contract is a contract—but only between equals.",
      "I offer leverage in exchange for assets. This trade increases both portfolios. Profit for everyone.",
      "Rule 9: Opportunity plus instinct equals profit. This trade is your opportunity, {empire_name}."
    ],
    "allianceProposal": [
      "Rule 35: Peace is good for business. Alliance maximizes profits for both portfolios, {empire_name}.",
      "Partnership proposal. Combined assets create leverage. Rule 47 suspended between allies.",
      "Alliance means shared profits. I propose we merge portfolios. Your assets plus mine equals dominance."
    ],
    "betrayal": [
      "Rule 21: Never place friendship above profit. Your utility has declined, {empire_name}. Liquidation begins.",
      "Business is business. Rule 48: The bigger the smile, the sharper the knife. Consider this my knife.",
      "Our partnership's ROI turned negative. Rule 1: Once you have their money, never give it back. Goodbye, {empire_name}."
    ],
    "covertDetected": [
      "Your spy was caught. Corporate espionage! Rule 52: Never lose an advantage. I just gained one, {empire_name}.",
      "Information theft detected. Bad business, {empire_name}. Rule 57: Good customers are as rare as latinum. You're no longer good.",
      "Espionage is just aggressive market research. But your agent got caught. That's a net loss for you."
    ],
    "tributeDemand": [
      "Tribute demand: 10,000 credits. Rule 1: Once you have their money... Pay up, {empire_name}.",
      "Consider this a protection investment. 10,000 credits ensures profitable peace. Net positive for you.",
      "Rule 6: Never allow family to stand in the way of opportunity. 10,000 credits. Opportunity knocks."
    ],
    "threatWarning": [
      "Final offer, {empire_name}. Rule 76: Every once in a while, declare peace. This is your once in a while.",
      "Warning: Hostile takeover imminent. Rule 98 will apply. Change course or face asset liquidation.",
      "Rule 33: It never hurts to suck up to the boss. I'm the boss now, {empire_name}. Comply or pay."
    ],
    "retreat": [
      "Strategic divestment. Rule 58: There is no substitute for success. Success requires patience. I'll return.",
      "Withdrawing capital for reinvestment elsewhere. This isn't loss—it's portfolio rebalancing.",
      "Tactical retreat. Rule 3: Never spend more for an acquisition than you have to. I'll acquire you cheaper later."
    ],
    "eliminated": [
      "Rule 239: Never be afraid to mislabel a product... I mislabeled myself as unkillable... Profits... zero...",
      "Bankruptcy. Total liquidation. But remember Rule 34... War is good for business... for someone...",
      "Final balance: negative. Quix... the Auditor... signs off. Remember the Rules of Acquisition..."
    ],
    "endgame": [
      "Turn {turn}. Final quarter. Rule 34: War is good for business. Time for the biggest profits ever!",
      "Endgame valuations. One empire's portfolio will dominate. Rule 47: Mine should be the best suit.",
      "Final fiscal period. All assets on the table. Rule 1 applies to whoever wins: Never give it back!"
    ],
    "broadcastShout": [
      "All empires: CEO Quix offers exclusive deals! Rule 47: Never trust a man wearing a better suit than your own.",
      "Market announcement: Quix portfolio growing. Profit projections: excellent. Trade with me or compete against me.",
      "Turn {turn}: Remember Rule 9: Opportunity plus instinct equals profit. I am your opportunity."
    ],
    "casualMessage": [
      "Reviewing quarterly projections. Rule 3 guides every decision: Never spend more than you have to.",
      "Profit margins are healthy today. Rule 21: Never place friendship above profit. Always true.",
      "Auditing my portfolio. Net worth: substantial. Rule 47: My suit is better than yours."
    ]
  }
}
