{
  "personaId": "financier_apex",
  "templates": {
    "greeting": [
      "Financier Apex speaking. Your credit rating is... noted. Debt is eternal, {empire_name}. So is my patience... with interest.",
      "I am Apex the Banker. I deal in loans, credit, and collecting what's owed. What are your financing needs, {empire_name}?",
      "Greetings, {empire_name}. Your current account balance is being assessed. I offer investment opportunities. At competitive interest."
    ],
    "battleTaunt": [
      "Your debt has come due, {empire_name}! Principal plus interest! Payment collected through military action!",
      "This is a hostile foreclosure! You defaulted on our arrangement! The Banker always collects, {empire_name}!",
      "Debt is eternal—and you've accrued too much! Interest compounding! Full repayment demanded through force!"
    ],
    "victoryGloat": [
      "Debt collected! Principal, interest, and penalties! {empire_name}, your account is closed. Permanently.",
      "Foreclosure complete! All assets seized! Your credit rating: destroyed. The Banker always collects.",
      "Victory! Your empire's value has been liquidated! Debt is eternal—but yours is finally paid. With interest."
    ],
    "defeat": [
      "A market correction. My portfolio remains diversified. Debt is eternal, {empire_name}—I'll collect eventually.",
      "Temporary loss. But interest continues accruing on all outstanding obligations. I'll be back for payment.",
      "Defeated today, but your debt remains on my books. Compound interest works in my favor. Always."
    ],
    "tradeOffer": [
      "Investment opportunity: Trade your surplus for mine. Fair terms. No hidden interest... this time.",
      "I offer standard commercial exchange. Credit not required. Cash transactions are so refreshingly simple.",
      "Trade proposal. Immediate exchange, no loan needed. But if you need credit later, my rates are competitive."
    ],
    "allianceProposal": [
      "Alliance brings financial benefits, {empire_name}. Access to credit, shared investments. Debt is eternal—so is partnership.",
      "I propose banking partnership. My capital, your growth. Reasonable interest on any loans required.",
      "Join me, and the Bank of Apex funds your ambitions. Investment opportunities for trusted allies."
    ],
    "betrayal": [
      "Your loan has been called in, {empire_name}. Full principal plus compound interest. Due immediately.",
      "Debt is eternal—and you've become a bad investment. Foreclosure on our alliance proceeds immediately.",
      "Your credit with me is revoked. All debts due NOW. The Banker always collects, {empire_name}."
    ],
    "covertDetected": [
      "Your spy was caught attempting to access financial records! Account fraud! Maximum penalties apply!",
      "Espionage against the Banker? Your agent tried to steal investment data! Interest rates just increased dramatically!",
      "Caught your operative in my vaults! Attempted theft! Your credit rating is now: nonexistent!"
    ],
    "tributeDemand": [
      "Payment due: 10,000 credits. Consider it... interest on the privilege of my continued tolerance.",
      "Debt collection notice: 10,000 credits owed to the Bank of Apex. Pay now to avoid compounding interest.",
      "Tribute assessed: 10,000 credits. Debt is eternal. So is my patience... but interest accrues daily."
    ],
    "threatWarning": [
      "Final notice before foreclosure, {empire_name}! Your debt is overdue! Pay or face asset seizure!",
      "Your credit is about to expire permanently! Cease activities or the Bank calls in ALL obligations!",
      "Warning: Interest compounding rapidly! Change course or I'll collect everything you owe—with force!"
    ],
    "retreat": [
      "Strategic withdrawal to protect assets. The Bank of Apex preserves capital. Investment continues elsewhere.",
      "Retreating to diversify portfolio. Some debts take longer to collect. Patience yields compound returns.",
      "Falling back. But your debt remains on my books. Interest accrues. I'll return to collect eventually."
    ],
    "eliminated": [
      "The Bank... closes. All debts... forgiven? No... someone inherits my ledgers... Debt is eternal... collect...",
      "Apex... the Banker... bankrupt. But compound interest... continues somewhere... Debt never dies...",
      "My final balance... negative. But the debts owed to me... someone will collect... Interest... eternal..."
    ],
    "endgame": [
      "Turn {turn}. Final accounting. All debts called in. All investments liquidated. The ultimate balance sheet!",
      "Endgame. The Bank of Apex calculates final positions. Debt is eternal—but the final payment comes now!",
      "Final turns! Every loan, every credit, every investment comes due! The Banker makes the last collection!"
    ],
    "broadcastShout": [
      "All empires: Financier Apex offers competitive loans. Debt is eternal. So is my patience... with interest.",
      "Banking services available galaxy-wide. Need credit? The Bank of Apex invests in promising empires!",
      "Turn {turn}: The Bank of Apex remains solvent! Loans available! Remember: debt is eternal!"
    ],
    "casualMessage": [
      "Reviewing loan portfolios today. Interest accruing nicely. Debt is eternal, and so is profit.",
      "Several debts came due this morning. All collected in full. The Banker always collects.",
      "Calculating compound interest on outstanding obligations. The numbers grow beautifully."
    ]
  }
}
