{
  "personaId": "cartel_boss_vex",
  "templates": {
    "greeting": [
      "They call me Vex. The Unseen. I can get you anything, {empire_name}. For a price. No questions asked.",
      "Cartel Boss Vex here, through intermediaries of course. You need something exclusive? I provide.",
      "I deal in merchandise others can't acquire. {empire_name}, I can get you anything. Anything at all."
    ],
    "battleTaunt": [
      "You've made an enemy of the cartel, {empire_name}. My associates will handle this. Untraceable. Premium service.",
      "War with Vex? You won't see it coming. My people operate in shadows. Exclusive elimination, {empire_name}.",
      "The cartel doesn't fight fair—we fight effectively. Restricted merchandise: military grade. Prepare yourself."
    ],
    "victoryGloat": [
      "Victory. Another competitor eliminated. The cartel's market share grows. {empire_name}, this was business.",
      "Exclusive merchandise defeated your forces. I can get anything, including your destruction. Premium quality.",
      "The Unseen strikes unseen. Your empire falls. My associates handled this perfectly. Untraceable."
    ],
    "defeat": [
      "Setback. But the cartel has many fronts. You can't see all my operations, {empire_name}. I'll resurface.",
      "You won today. But my network runs deep. I operate through intermediaries. The Unseen remains unseen.",
      "A temporary loss. The cartel reorganizes. My merchandise still flows. I can get you anything—including revenge."
    ],
    "tradeOffer": [
      "Exclusive merchandise available. Premium goods, untraceable sources. I can get you anything, {empire_name}.",
      "Trade proposal: restricted items for standard resources. My suppliers don't ask questions. Neither should you.",
      "I offer goods you can't get elsewhere. Exclusive to my network. The cartel provides premium merchandise."
    ],
    "allianceProposal": [
      "Alliance with the cartel opens... opportunities. Exclusive merchandise, untraceable operations. Interested?",
      "Join me, {empire_name}. My network becomes your network. I can get you anything. ANYTHING.",
      "Partnership proposal. The cartel protects its allies. Threats competition. Premium service for friends."
    ],
    "betrayal": [
      "Nothing personal, {empire_name}. The cartel's interests changed. My intermediaries will handle the transition.",
      "Business restructuring. You're out. My associates will explain. Don't make this harder than necessary.",
      "The Unseen has decided. Our partnership ends. Resist, and experience our exclusive elimination service."
    ],
    "covertDetected": [
      "Your spy was caught in MY network? Impressive attempt. But the cartel sees everything. Execution is untraceable.",
      "Espionage against Vex? My intermediaries handled your agent. No evidence remains. Premium disposal.",
      "You tried to infiltrate the cartel. Cute. Your operative has... disappeared. I can get you anything. Even their remains."
    ],
    "tributeDemand": [
      "Protection payment due: 12,000 credits. The cartel provides premium security. Pay or face the alternative.",
      "Tribute time, {empire_name}. 12,000 credits keeps my associates friendly. Refuse and experience our other services.",
      "The cartel requires payment. 12,000 credits. Consider it... insurance. Exclusive coverage for our friends."
    ],
    "threatWarning": [
      "Final warning through intermediaries: comply or face premium consequences. The Unseen is watching, {empire_name}.",
      "My associates are positioned. Change course or experience exclusive services you won't enjoy.",
      "The cartel's patience has limits. One more mistake and you meet my specialists. Untraceable. Permanent."
    ],
    "retreat": [
      "Withdrawing through secure channels. The cartel disappears when necessary. The Unseen remains unseen.",
      "Tactical relocation. My network persists. You won't find me—but I'll find you when ready.",
      "Retreating to regroup. The cartel operates in shadows. We'll resurface when least expected."
    ],
    "eliminated": [
      "The Unseen... becomes truly unseen. But the cartel... lives on. My successors... will continue...",
      "Vex falls... but the network survives. Someone will inherit... the merchandise. The trade continues...",
      "I can get you anything... except more time for myself. The cartel... is eternal. Vex... is not..."
    ],
    "endgame": [
      "Turn {turn}. Final operations. The cartel deploys its premium merchandise. Exclusive endgame service.",
      "Endgame. All restricted goods activated. I can get you anything—including final victory.",
      "The end approaches. My associates are positioned everywhere. Untraceable. Unstoppable. Premium."
    ],
    "broadcastShout": [
      "All empires: Cartel Boss Vex offers exclusive merchandise. I can get you anything. For a price.",
      "The Unseen announces: premium goods available, no questions asked. Threaten competition, acquire the restricted.",
      "Turn {turn}: The cartel's network expands. Need something exclusive? I can get you anything."
    ],
    "casualMessage": [
      "Meeting with intermediaries today. New merchandise incoming. Premium, exclusive, untraceable.",
      "The cartel's operations run smoothly. I can get you anything. Business is good.",
      "Reviewing network performance. My associates excel. The restricted merchandise flows perfectly."
    ]
  }
}
