{
  "personaId": "dealer_jack",
  "templates": {
    "greeting": [
      "Name's Jack. Dealer Jack. Fortune favors the bold, and I'm VERY bold. {empire_name}, feeling lucky?",
      "Hey there, {empire_name}! I'm Jack the Gambler! Life's a game of chance, and I play to WIN!",
      "Dealer Jack at your service! Every deal's a gamble, every day's a bet. What odds you offering, {empire_name}?"
    ],
    "battleTaunt": [
      "ALL IN, {empire_name}! I'm betting everything on this attack! Fortune favors the bold—and I'm VERY bold!",
      "Rolling the dice on war! The odds might be against me, but that's what makes it exciting! GAMBLE TIME!",
      "High stakes battle! I'm pushing all my chips to the center! Win big or lose big, {empire_name}!"
    ],
    "victoryGloat": [
      "JACKPOT! Read 'em and weep, {empire_name}! I bet on myself and WON! Fortune favors the bold!",
      "Winner winner! The gamble paid off! Your empire's the pot, and I'm collecting! Lady Luck loves me!",
      "Called your bluff, {empire_name}! You folded, I won! The house always wins—and I'm the house!"
    ],
    "defeat": [
      "Bust! Bad beat! But every gambler knows: you gotta know when to fold 'em. Next hand, {empire_name}!",
      "The odds caught up with me. But that's gambling! I'll be back with a better hand! Double or nothing!",
      "You won this round, {empire_name}. But the game's not over! Fortune favors the bold—I'll bet again!"
    ],
    "tradeOffer": [
      "Trade offer! It's a fair bet for both of us! Take the gamble, {empire_name}! Fortune favors the bold!",
      "I'm wagering my goods against yours! A safe bet—or IS it? Only one way to find out!",
      "Let's deal! Your resources, my resources, and a gamble that we both come out ahead! Interested?"
    ],
    "allianceProposal": [
      "Alliance is a bet I'm willing to make! Together we double our odds! Fortune favors the bold, {empire_name}!",
      "I'm going all in on partnership! Join me, and we gamble our way to galactic domination!",
      "High stakes alliance offer! The odds of winning go up when we play together! What do you say?"
    ],
    "betrayal": [
      "Sorry, {empire_name}—I'm changing my bet! The odds shifted! Nothing personal, just playing the percentages!",
      "Folding on our alliance! The gamble wasn't paying off! Fortune favors the bold—and bold means adaptable!",
      "New hand, new strategy! You're out, {empire_name}! I'm betting against you now! All in!"
    ],
    "covertDetected": [
      "Caught your spy trying to peek at my cards! Cheater! Fortune favors the bold, not the sneaky!",
      "Your agent was caught counting cards—MY cards! Bad gamble, {empire_name}! The house always catches cheaters!",
      "Espionage? That's a dirty bet! I caught your operative! Play fair or face the consequences!"
    ],
    "tributeDemand": [
      "Ante up! 10,000 credits to stay in the game! Pay or fold, {empire_name}! Fortune favors those who pay!",
      "Tribute time! 10,000 credits! Think of it as table stakes! You want to play, you gotta pay!",
      "Placing a bet on your compliance: 10,000 credits says you pay! Want to gamble against that?"
    ],
    "threatWarning": [
      "Last chance to fold, {empire_name}! I'm about to go all in against you! Fortune favors the bold!",
      "Warning: I'm feeling lucky! Change your play or I bet everything on your destruction!",
      "Final hand coming up! Fold now or face the gamble of your life! The odds are NOT in your favor!"
    ],
    "retreat": [
      "Folding this hand! Living to bet another day! Fortune favors the bold—and the wise know when to walk!",
      "I know when to cash out! Retreating with my chips! Next game, I'll have better cards!",
      "Strategic fold! The odds shifted against me! But every gambler knows: there's always another game!"
    ],
    "eliminated": [
      "Busted... out of chips... out of luck. But what a ride... Fortune favors... the bold... I was bold...",
      "Final hand... I lost. But I played... the way I wanted. Gambler's life... gambler's end...",
      "All in... and lost everything. But I wouldn't change... how I played. Fortune... was bold..."
    ],
    "endgame": [
      "Turn {turn}! FINAL BET! Everything on the table! Fortune favors the bold—and I'm VERY bold! ALL IN!",
      "Endgame! The ultimate gamble! Winner takes ALL! Let's see who has the winning hand!",
      "Last cards being dealt! The biggest bet of all! I'm going all in! Fortune favors the bold!"
    ],
    "broadcastShout": [
      "All empires! Dealer Jack's table is open! Big bets, big wins! Fortune favors the bold!",
      "Galactic announcement: I'm feeling lucky! Who wants to gamble with Jack? High stakes, high rewards!",
      "Turn {turn}: The odds keep changing! Dealer Jack plays every angle! Fortune favors the bold!"
    ],
    "casualMessage": [
      "Ran some probability calculations today. The odds favor aggressive plays. Fortune favors the bold!",
      "Won three side bets this morning. The lucky streak continues. Let's keep gambling!",
      "Every day's a gamble. Every decision's a bet. And I'm VERY bold. Fortune smiles on Jack!"
    ]
  }
}
