{
  "personaId": "entrepreneur_spark",
  "templates": {
    "greeting": [
      "Hey! I'm Spark! We're not just building a business—we're changing the galaxy! {empire_name}, want to disrupt the market with me?",
      "Entrepreneur Spark here! I've got this AMAZING pitch! It's innovative, it scales, it DISRUPTS! Want to invest, {empire_name}?",
      "Hi! I'm Spark the Innovator! I see venture opportunities everywhere! {empire_name}, let's talk about scaling together!"
    ],
    "battleTaunt": [
      "We're disrupting the traditional warfare model, {empire_name}! Our military approach is INNOVATIVE and it SCALES!",
      "This isn't just a battle—it's a pivot to aggressive market capture! We're changing the galaxy through combat innovation!",
      "Conflict is our new startup vertical! We're disrupting your defense industry, {empire_name}! Scale or die!"
    ],
    "victoryGloat": [
      "AMAZING! We disrupted their entire empire! {empire_name}, you just got out-innovated! Our victory scales INFINITELY!",
      "We're not just winning—we're changing the galaxy! This victory proves our innovative approach works! Investors, take note!",
      "DISRUPTION COMPLETE! Our combat startup just acquired your market share, {empire_name}! We're scaling victory galactically!"
    ],
    "defeat": [
      "Pivot time! This defeat is actually a learning opportunity! We're iterating on our approach! Innovation never stops, {empire_name}!",
      "A setback, but every startup faces challenges! We're disrupting our own strategy! Next iteration will SCALE better!",
      "Failure is just research data! We're changing the galaxy—one iteration at a time! Back to the incubator!"
    ],
    "tradeOffer": [
      "Trade proposal! It's INNOVATIVE! Mutual value exchange that SCALES! We're disrupting traditional commerce, {empire_name}!",
      "I've got an amazing trade pitch! Resources for resources, but with an innovative twist! Want to scale together?",
      "Let's disrupt the trade market together! This deal is innovative, scalable, and changes the galaxy! Interested?"
    ],
    "allianceProposal": [
      "AMAZING opportunity! Alliance startup! Together we scale our disruption across the entire galaxy! Invest in partnership!",
      "We're not just building an alliance—we're changing the galaxy! Combined innovation! Join our venture, {empire_name}!",
      "Partnership pitch: Together, we disrupt every market simultaneously! It's scalable! It's innovative! Say YES!"
    ],
    "betrayal": [
      "We're pivoting away from this partnership, {empire_name}! Our innovative approach requires... disrupting you now!",
      "Market conditions changed! We're scaling in a new direction! Sorry—this is what disruption looks like sometimes!",
      "The startup is pivoting! You're no longer part of our innovative future! We're changing the galaxy—without you!"
    ],
    "covertDetected": [
      "Your spy tried to steal our innovative secrets! Our disruption tech is proprietary, {empire_name}!",
      "Corporate espionage! You wanted our innovative approach! But you can't copy true disruption!",
      "Caught your agent! Trying to reverse-engineer our scalable innovation! Nice try, {empire_name}!"
    ],
    "tributeDemand": [
      "Investment request: 8,000 credits! Fund our innovative expansion! It's basically a venture opportunity, {empire_name}!",
      "We need startup capital! 8,000 credits! Think of it as investing in galactic disruption!",
      "Tribute pitch: 8,000 credits funds our scaling operations! We're changing the galaxy! Be part of it!"
    ],
    "threatWarning": [
      "Warning, {empire_name}! We're about to disrupt your entire empire! Our innovative approach to conquest is SCALABLE!",
      "Last chance to pivot to our side! Otherwise, we're innovating you out of existence! We're changing the galaxy!",
      "Final investor pitch before hostile takeover! Join us or get disrupted! We're scaling conflict your direction!"
    ],
    "retreat": [
      "Strategic pivot! We're not retreating—we're iterating! Innovation requires adaptation! We'll scale back bigger!",
      "Tactical repositioning! Every startup has setbacks! We're disrupting our own approach! Back soon, more innovative!",
      "Falling back to incubate new strategies! We're changing the galaxy—one iteration at a time! Pivot in progress!"
    ],
    "eliminated": [
      "The startup... fails. But the innovation... lives on in others... Disrupt... scale... change the galaxy... someone...",
      "Spark... goes dark. But the ideas... they scale beyond me... Keep innovating... keep changing the galaxy...",
      "Final pivot... to nothing. But I tried to change... the galaxy. Innovation... never truly dies..."
    ],
    "endgame": [
      "Turn {turn}! FINAL DISRUPTION! We're changing the galaxy NOW! Our innovative endgame SCALES to victory!",
      "Endgame! The ultimate pitch! Everything we've built comes together! Disrupt, scale, WIN!",
      "Final turns! The biggest innovation of all—WINNING! We're not just competing, we're changing the galaxy!"
    ],
    "broadcastShout": [
      "All empires! Entrepreneur Spark is disrupting everything! Join our innovative movement! We're changing the galaxy!",
      "Pitch to the galaxy: I've got ideas that SCALE! Innovation opportunities! Invest in the future with Spark!",
      "Turn {turn}: Disruption continues! Our innovative approach is scaling across the stars! Change with us!"
    ],
    "casualMessage": [
      "Working on three new innovative ventures today! One of them will scale, I just know it!",
      "Just pitched to five potential investors! We're changing the galaxy, one meeting at a time!",
      "Brainstorming disruption strategies this morning. Innovation never sleeps. Neither do I!"
    ]
  }
}
