{
  "personaId": "magnate_sterling",
  "templates": {
    "greeting": [
      "Magnate Sterling, of the Sterling dynasty. Our family's wealth spans generations, {empire_name}. Yours... is noted.",
      "I am Sterling the Wealthy. My heritage is distinguished. My pedigree unquestionable. And you are, {empire_name}?",
      "Greetings. The Sterling legacy speaks for itself. Wealth is not merely acquired—it is inherited with dignity."
    ],
    "battleTaunt": [
      "How tiresome. Must I really sully my legacy with conflict, {empire_name}? Very well. My family's military traditions will prevail.",
      "War is beneath true aristocracy, but you've left me no choice. The Sterling dynasty crushes those who forget their place.",
      "Nouveau riche rabble. {empire_name}, you'll learn why old money always triumphs over new pretenders."
    ],
    "victoryGloat": [
      "As expected. Breeding tells, {empire_name}. The Sterling legacy claims another victory for our distinguished heritage.",
      "Refinement conquers vulgarity. Your defeat adds to our family's honored traditions. Most gratifying.",
      "Victory befitting our pedigree. The Sterling dynasty's record remains unblemished. Quite dignified."
    ],
    "defeat": [
      "How... undignified. But the Sterling legacy has weathered worse. Our heritage will outlast this temporary embarrassment.",
      "A setback for the dynasty, but our wealth runs deep. Old money recovers. We always have.",
      "Unexpected. But a distinguished family learns from adversity. The Sterling name will be restored."
    ],
    "tradeOffer": [
      "I condescend to offer trade, {empire_name}. Fair terms, befitting my family's distinguished reputation.",
      "Commerce between equals—or as close to my equal as you can be. The Sterling legacy deals fairly.",
      "A refined exchange. My surplus for yours. Wealth is not merely acquired—it flows between the worthy."
    ],
    "allianceProposal": [
      "The Sterling dynasty considers extending our heritage to include you, {empire_name}. A distinguished partnership.",
      "Alliance with old money brings legitimacy. Our family's legacy would elevate your standing considerably.",
      "I propose refined partnership. The Sterling pedigree, combined with your... potential. Consider it an honor."
    ],
    "betrayal": [
      "New money always disappoints. Our association no longer befits the Sterling legacy, {empire_name}. We are finished.",
      "The family council has decided. Your value to our heritage has diminished. Consider yourself... dismissed.",
      "How tiresome to end this partnership, but dignity requires it. The Sterling name cannot be tarnished by association."
    ],
    "covertDetected": [
      "Spies? How utterly vulgar, {empire_name}. The Sterling household does not tolerate such low behavior.",
      "Espionage is for those without proper breeding. Your agent has been dealt with. Most undignified.",
      "New money tactics. Our family's security caught your operative. Such behavior is beneath contempt."
    ],
    "tributeDemand": [
      "Tribute is due to the Sterling dynasty. 10,000 credits. Consider it payment for the privilege of our attention.",
      "Old money has certain expectations. 10,000 credits maintains our distinguished tolerance of your presence.",
      "The Sterling legacy requires appropriate recognition. 10,000 credits. Wealth flows to those with proper heritage."
    ],
    "threatWarning": [
      "Final warning, befitting my station. Change course, {empire_name}, or face the distinguished wrath of the Sterling dynasty.",
      "I tire of your provocations. Cease, or our family's military traditions will remind you of your place.",
      "Consider this a refined ultimatum. The Sterling legacy does not issue many warnings. Heed this one."
    ],
    "retreat": [
      "A dignified withdrawal. The Sterling dynasty preserves its legacy for future engagements. Most prudent.",
      "Tactical retreat befitting old money wisdom. We preserve family assets for better opportunities.",
      "Falling back with dignity intact. The Sterling heritage values preservation over pyrrhic gestures."
    ],
    "eliminated": [
      "The Sterling dynasty... ends. But our legacy... our heritage... will be remembered... Dignity... in death...",
      "Old money... fades. But the Sterling name... our traditions... carry on in memory... Distinguished... to the end...",
      "The family line... concludes. But wealth inherited with dignity... is legacy enough... Remember the Sterlings..."
    ],
    "endgame": [
      "Turn {turn}. The final legacy moment. The Sterling dynasty faces destiny with distinguished resolve.",
      "Endgame. Old money versus all pretenders. The Sterling heritage shall prove its pedigree.",
      "Final turns. Our family's generations of wealth and wisdom converge. Dignified victory or distinguished defeat."
    ],
    "broadcastShout": [
      "All empires: The Sterling dynasty's heritage outshines all new money pretenders. Remember your place.",
      "Announcement from old money: Magnate Sterling observes the galaxy's nouveau riche with refined amusement.",
      "Turn {turn}: The Sterling legacy endures. Wealth is not merely acquired—it is inherited with dignity."
    ],
    "casualMessage": [
      "Reviewing family portraits this morning. Such distinguished ancestors. Such refined legacy.",
      "The Sterling dynasty's accounts show healthy growth. Old money knows how to preserve wealth.",
      "Met with financial advisors today. Our heritage spans seventeen generations. Quite distinguished."
    ]
  }
}
