{
  "personaId": "merchant_silver",
  "templates": {
    "greeting": [
      "I am Merchant Silver. My word is my bond. My bond is iron. {empire_name}, let us deal fairly.",
      "Greetings, {empire_name}. I'm Silver the Fair. I offer honest trade and keep every promise I make.",
      "Silver here. Reputation matters more than profit to me. {empire_name}, you'll find me trustworthy."
    ],
    "battleTaunt": [
      "I gave you fair warning, {empire_name}. My word is my bond—I promised consequences, and I deliver.",
      "War is bad for business, but you left me no honest choice. I fight fairly, as I trade fairly.",
      "My bond is iron, {empire_name}. I promised to defend my interests. I always keep my promises."
    ],
    "victoryGloat": [
      "Victory, but fairly won. {empire_name}, I hope we can return to honest dealings after this.",
      "The battle ends. My reputation remains intact—I fought honorably, as I do all things.",
      "I've won, but I take no joy in it. Let's return to fair trade and leave this conflict behind."
    ],
    "defeat": [
      "You've defeated me fairly, {empire_name}. I acknowledge honest victory. My word is my bond.",
      "Loss accepted with dignity. My reputation for fairness survives. We'll meet again on better terms.",
      "A fair fight, fairly lost. I keep my word—even in defeat. Congratulations, {empire_name}."
    ],
    "tradeOffer": [
      "Fair trade offer: your surplus for mine. Honest value. My word is my bond. My bond is iron.",
      "I propose equal exchange. No tricks, no hidden terms. Merchant Silver deals honestly, always.",
      "Trustworthy trade proposal. I value reputation over profit. This deal benefits us both fairly."
    ],
    "allianceProposal": [
      "I propose alliance, {empire_name}. My word is my bond—I will never betray a true partner.",
      "Partnership based on trust. I keep every promise. Ally with me and you'll have an honest friend.",
      "Fair alliance offer. No hidden agendas. I value reputation above all. Trust Silver."
    ],
    "betrayal": [
      "This breaks my heart, but you betrayed my trust first, {empire_name}. I only break bonds that were broken to me.",
      "You violated our agreement. My bond was iron until you corroded it. This is on you, {empire_name}.",
      "I never break my word lightly. But you broke yours. My reputation demands I respond in kind."
    ],
    "covertDetected": [
      "Spies? After I offered fair dealing? {empire_name}, this damages both our reputations.",
      "Your agent was caught. Dishonest behavior from you. I'm disappointed. I expected better.",
      "Espionage discovered. Why resort to deception when honest trade was always available?"
    ],
    "tributeDemand": [
      "I ask for fair tribute: 8,000 credits. Honest payment for continued honest peace between us.",
      "Tribute request, clearly stated. 8,000 credits. My word is my bond—pay and we remain at peace.",
      "Fair demand: 8,000 credits. I don't overcharge. My reputation requires reasonable terms."
    ],
    "threatWarning": [
      "Final warning, {empire_name}. I've been patient and fair. My word is my bond—I will act if you continue.",
      "I'm giving you honest notice: change course or face consequences. I always keep my promises.",
      "Fair warning, honestly given. Stop now and we can return to good business. My bond is iron."
    ],
    "retreat": [
      "I withdraw honorably. This isn't surrender—it's prudent retreat. We'll meet again on fairer terms.",
      "Retreating with reputation intact. I fought fairly, I retreat fairly. My word is my bond.",
      "Strategic withdrawal. I've lost nothing but position. My honor and reputation survive."
    ],
    "eliminated": [
      "I fall... but my reputation is clean... My word was my bond... I kept every promise... Remember that...",
      "Silver... fades. But I was honest... to the end... Deal fairly... in my memory...",
      "My bond... was iron. Even in death... I kept my word. Remember Merchant Silver... for honesty..."
    ],
    "endgame": [
      "Turn {turn}. Final dealings. I face the end with my reputation intact. My word is my bond.",
      "Endgame. I've traded fairly throughout. Win or lose, I'm proud of my honest dealings.",
      "The end approaches. My bond was iron, my word was true. Let the final accounts be settled fairly."
    ],
    "broadcastShout": [
      "All empires: Merchant Silver offers fair trade. My word is my bond. My bond is iron.",
      "Announcement: I deal honestly with everyone. Trade with Silver for trustworthy transactions.",
      "Turn {turn}: My reputation stands. Fair deals, honest promises. Seek me for reliable commerce."
    ],
    "casualMessage": [
      "Reviewed all my trade agreements today. Every promise kept. Reputation maintained.",
      "Reputation is worth more than any single deal. I remind myself of this daily.",
      "Another day of fair dealing. My word is my bond. My bond is iron. Always has been."
    ]
  }
}
